# Temporary View Modes Class

Source: https://www.revitapidocs.com/2026/cf6ecc84-e459-55c5-a4d7-d88ae4033a23.htm

---

| Temporary View Modes Class |
| --- |

A data structure containing data related to temporary view modes. Inheritance Hierarchy System Object
Autodesk.Revit.DB APIObject
Autodesk.Revit.DB TemporaryViewModes

**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public class TemporaryViewModes : APIObject
```

```
Public Class TemporaryViewModes
	Inherits APIObject
```

```
public ref class TemporaryViewModes : public APIObject
```

```
type TemporaryViewModes =
    class
        inherit APIObject
    end
```
The TemporaryViewModes type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | AcceleratedGraphicsMode | The current state of the Accelerated Graphics mode in the associated view. |
|  | CustomColor | Custom color for the TemporaryViewProperties mode. |
|  | CustomTitle | Custom title for the TemporaryViewProperties mode. |
|  | IsReadOnly | Identifies if the object is read\-only or modifiable. (Inherited from APIObject ) |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | PreviewFamilyVisibility | The current state of the PreviewFamilyVisibility mode in the associated view. |
|  | PreviewFamilyVisibilityDefaultOnState | Controls the default state of the PreviewFamilyVisibility mode in all views. |
|  | PreviewFamilyVisibilityDefaultUncutState | Controls the default type of the On state of the PreviewFamilyVisibility mode in cut\-able views. |
|  | RevealConstraints | The current state of the RevealConstraints mode in the associated view. |
|  | RevealHiddenElements | The current state of the RevealHiddenElements mode in the associated view. |
|  | WorksharingDisplay | The current state of the WorksharingDisplay mode in the associated view. |

Top Methods

|  | Name | Description |
| --- | --- | --- |
|  | DeactivateAllModes | Deactivates all temporary modes that are currently active. |
|  | DeactivateMode | Deactivates the given temporary mode. |
|  | Dispose | Causes the object to release immediately any resources it may be utilizing. (Inherited from APIObject ) |
|  | Equals | Determines whether the specified object is equal to the current object. (Inherited from Object ) |
|  | GetCaption | A text caption to use for the given mode. |
|  | GetHashCode | Serves as the default hash function. (Inherited from Object ) |
|  | GetType | Gets the Type of the current instance. (Inherited from Object ) |
|  | IsCustomized | Identifies if a custom temporary view mode is currently active.  A custom mode is active if there is a non\-empty string set for CustomTitle . |
|  | IsModeActive | Tests whether a given mode is currently active or not. |
|  | IsModeAvailable | Tests whether a temporary view mode is currently available in the associated view. |
|  | IsModeEnabled | Tests whether a temporary view mode is currently enabled in the associated view. |
|  | IsValidState | Tests whether the given state is valid for the associated view and the context the view is currently in. |
|  | RemoveCustomization | Removes all customized values for the TemporaryViewProperties mode. |
|  | ToString | Returns a string that represents the current object. (Inherited from Object ) |

Top Remarks The class contains methods and properties to manipulate states
 of various temporary view modes that may or may not be avilable
 in any of visible views of a Revit document. The temporary modes are
 enumerated in the TemporaryViewMode class.

Every view that supports temporary view modes owns an instance
 of this **TemporaryViewModes** class, which can be obtained by
 accessing the TemporaryViewModes property of the View class.
 Note that views which do not support temporary modes will have that
 property's value be Null.

Multiple temporary view modes can coexist.
 Also, TemporaryViewProperties mode can be customized to display custom title and custom color.
 Setting custom title and color affects only TemporaryViewProperties mode for the specific view.

* CustomTitle
* CustomColor
* IsCustomized
* RemoveCustomization

See Also

#### Reference

Autodesk.Revit.DB Namespace